# BalustersTooCloseAbsolute Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..BalustersTooCloseAbsolute Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Baluster Separation is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BalustersTooCloseAbsolute { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BalustersTooCloseAbsolute As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BalustersTooCloseAbsolute {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace